app/views/items/index.html.erb

<script>
  const locations = <%== Item.all.to_json %>;
---
SELECT "items".* FROM "items"