app/views/items/show.html.erb

  </li>
  <% if @item.user.present? %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]