app/controllers/items_controller.rb

SELECT "items".* FROM "items" WHERE (title ILIKE '%mexico%' OR address ILIKE '%mexico%' OR image ILIKE '%mexico%' OR condition ILIKE '%mexico%') ORDER BY created_at DESC
---
  def index
   @items = Item.all

SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
---
  def show
 @item = Item.find params[:id]

SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
---
  def edit
  @item = Item.find params[:id]

SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "items" SET "address" = $1, "latitude" = $2, "longitude" = $3, "updated_at" = $4 WHERE "items"."id" = $5  [["address", "Double Bay NSW"], ["latitude", -33.8775], ["longitude", 151.2412], ["updated_at", "2018-07-17 00:03:47.397970"], ["id", 16]]
---
  def update
    item = Item.find params[:id]
    item.update item_params

INSERT INTO "items" ("title", "location", "image", "condition", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    item = Item.create item_params

SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "items" WHERE "items"."id" = $1  [["id", 5]]
---
  def destroy
    item = Item.find params[:id]
      item.destroy