app/controllers/users_controller.rb

  def update
    user = User.find params[:id]
    user.update user_params
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "image" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "Trump president"], ["image", "https://media.gq.com/photos/5ac68bdf0995d03672949444/3:2/w_880/trump-hair.jpg"], ["updated_at", "2018-07-17 02:21:31.336087"], ["id", 8]]

  def create
    @user = User.new user_params
    if @user.save
---
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"